
// const str = 'test';

// console.log(str.length);

// const str = 'test';

// console.log(str[2]);

// const arr = [1, 2, 4];

// console.log(arr.length);

// СТРОКИ
//===Методы изменения регистра=====================================================================================================================================================

// const str = 'test';

// console.log(str.toUpperCase());
// console.log(str);

//===indexOf() ПОИСК ПОДСТРОКИ Метод найти кусочек строки и сказать с какого индекса с какой позиции она начинается=====================================================================================================================================================

// const fruit = 'Some fruit';

// console.log(fruit.indexOf('fruit'));
// // слово Some равно 0, 1, 2, 3 и пробел 4, наше слово fruit начинается с 5 позиции

//===SLICE Вырезает нужный фрагмент кода, последнне значение аргумента не включая ( то, что нам необходимо не включая)=====================================================================================================================================================

// const logg = 'Hello world';

// console.log(logg.slice(6, 11));

// const logg = 'Hello world';

// console.log(logg.slice(6));

// const logg = 'Hello world';

// console.log(logg.slice(-5, -1));

//===SUBSTRING=похож на SLICE, можно указывать первый аргумент больше второго и нельзя указывать отрицаиельные значения====================================================================================================================================================

// const logg = 'Hello world';

// console.log(logg.substring(6, 11));

//===SUBSTR во втором аргументе указываем сколько длину сколько символов нам нужно вырезать=====================================================================================================================================================


// const logg = 'Hello world';

// console.log(logg.substr(6, 5));

// ЧИСЛА

//====Округление====================================================================================================================================================

// округляем к ближайшему целому

// const num = 12.2;
// console.log(Math.round(12.2));


//===Преобоазуем строки в числа=====================================================================================================================================================

// const test = '12.2px';
// console.log(parseInt(test));


//===parseFloat это метод для того взять какое то число либо строку и вернуть нам в десятичном варианте это значение =====================================================================================================================================================
